const 임대1 = [
    'HP 1그룹 인터록',
    'HP 2그룹 인터록',
    'HP_1 공급온도',  
    'HP_1 환수온도',  
    'HP_2 공급온도',  
    'HP_2 환수온도',  
    'HP_3 공급온도',  
    'HP_3 환수온도',  
    'HP_4 공급온도',  
    'HP_4 환수온도',  
    'HP_5 공급온도',  
    'HP_5 환수온도',  
    'HP_6 공급온도',  
    'HP_6 환수온도',  
    'HP_7 공급온도',  
    'HP_7 환수온도',  
    'HP_8 공급온도',  
    'HP_8 환수온도',  
    'HP_9 공급온도',
    'HP_9 환수온도',
    'P_1 HP환수온도',
    'P_1 탱크환수온도',
    'P_1 헤더온도',
    'P_2 HP환수온도',
    'P_2 탱크환수온도',
    'P_2 헤더온도',
    'T1 탱크 고수위 경보',
    'T1 탱크 수위',
    'T1 탱크 저수위 경보',
    'T2 탱크 고수위 경보',
    'T2 탱크 수위',
    'T2 탱크 저수위 경보',
    'TK_1 2차공급온도',
    'TK_1 2차환수온도',
    'TK_1 공급온도',
    'TK_1 온도1',
    'TK_1 온도2',
    'TK_1 온도3',
    'TK_1 온도4',
    'TK_1 환수온도',
    'TK_2 2차공급온도',
    'TK_2 2차환수온도',
    'TK_2 공급온도',
    'TK_2 온도1',
    'TK_2 온도2',
    'TK_2 온도3',
    'TK_2 온도4',
    'TK_2 환수온도',
    'VP_FLOW1',
    'VP_FLOW2',
    'VP_HP1그룹_Flag',
    'VP_HP2그룹_Flag',
    'VP_T1 난방Off설정온도',
    'VP_T1 난방On설정온도',
    'VP_T1 냉방Off설정온도',
    'VP_T1 냉방On설정온도',
    'VP_T1 주펌프선택',
    'VP_T1 탱크온도',
    'VP_T1 히트펌프 운전모드',
    'VP_T1 히트펌프 자동수동',
    'VP_T2 난방Off설정온도',
    'VP_T2 난방On설정온도',
    'VP_T2 냉방Off설정온도',
    'VP_T2 냉방On설정온도',
    'VP_T2 제어용 탱크온도',
    'VP_T2 주펌프선택',
    'VP_T2 탱크온도',
    'VP_T2 히트펌프 운전모드',
    'VP_T2 히트펌프 자동수동',
    'VP_보일러 Off설정온도',
    'VP_보일러 On설정온도',
    'VP_보일러 기동정지',
    'VP_절환밸브 기동정지',
    'VP_절환밸브 자동수동',
    'VP_절환밸브_Flag',
    'VP_타이머_초',
    'VP_타이머1_Flag1',
    'VP_타이머1_Flag2',
    'VP_히트펌프1 제어명령',
    'VP_히트펌프2 제어명령',
    'VP_히트펌프3 제어명령',
    'VP_히트펌프4 제어명령',
    'VP_히트펌프5 제어명령',
    'VP_히트펌프6 제어명령',
    'VP_히트펌프7 제어명령',
    'VP_히트펌프8 제어명령',
    'VP_히트펌프9 제어명령',
    '공급절환밸브 기동정지',
    '기계실 급기1 운전상태',
    '기계실 급기2 운전상태',
    '기계실 급기팬1 기동정지',
    '기계실 급기팬2 기동정지',
    '기계실 배기1 운전상태',
    '기계실 배기2 운전상태',
    '기계실 배기팬1 기동정지',
    '기계실 배기팬2 기동정지',
    '보일러 경보',
    '보일러 공급온도',
    '보일러 기동정지',
    '보일러 밸브 기동정지',
    '보일러 순환펌프 기동정지',
    '보일러 순환펌프 운전상태',
    '보일러 운전상태',
    '보일러 환수온도',
    '순환펌프1 기동정지',
    '순환펌프1 운전상태',
    '순환펌프2 기동정지',
    '순환펌프2 운전상태',
    '순환펌프3 기동정지',
    '순환펌프3 운전상태',
    '순환펌프4 기동정지',
    '순환펌프4 운전상태',
    '원수탱크 수위',
    '전기실 급기 운전상태',
    '전기실 급기팬 기동정지',
    '전기실 배기 운전상태',
    '전기실 배기팬 기동정지',
    '환수절환밸브 기동정지',
    '히트펌프1_기동정지',
    '히트펌프1_난방설정온도',
    '히트펌프1_냉방설정온도',
    '히트펌프1_에러코드',
    '히트펌프1_운전모드',
    '히트펌프1_운전전류',
    '히트펌프1_인버터출력_1-1',
    '히트펌프1_인버터출력_1-2',
    '히트펌프1_인버터출력_2-1',
    '히트펌프1_인버터출력_2-2',
    '히트펌프1_입수온도',
    '히트펌프1_출수온도',
    '히트펌프2_기동정지',
    '히트펌프2_난방설정온도',
    '히트펌프2_냉방설정온도',
    '히트펌프2_에러코드',
    '히트펌프2_운전모드',
    '히트펌프2_운전전류',
    '히트펌프2_인버터출력_1-1',
    '히트펌프2_인버터출력_1-2',
    '히트펌프2_인버터출력_2-1',
    '히트펌프2_인버터출력_2-2',
    '히트펌프2_입수온도',
    '히트펌프2_출수온도',
    '히트펌프3_기동정지',
    '히트펌프3_난방설정온도',
    '히트펌프3_냉방설정온도',
    '히트펌프3_에러코드',
    '히트펌프3_운전모드',
    '히트펌프3_운전전류',
    '히트펌프3_인버터출력_1-1',
    '히트펌프3_인버터출력_1-2',
    '히트펌프3_인버터출력_2-1',
    '히트펌프3_인버터출력_2-2',
    '히트펌프3_입수온도',
    '히트펌프3_출수온도',
    '히트펌프4_기동정지',
    '히트펌프4_난방설정온도',
    '히트펌프4_냉방설정온도',
    '히트펌프4_에러코드',
    '히트펌프4_운전모드',
    '히트펌프4_운전전류',
    '히트펌프4_인버터출력_1-1',
    '히트펌프4_인버터출력_1-2',
    '히트펌프4_인버터출력_2-1',
    '히트펌프4_인버터출력_2-2',
    '히트펌프4_입수온도',
    '히트펌프4_출수온도',
    '히트펌프5_기동정지',
    '히트펌프5_난방설정온도',
    '히트펌프5_냉방설정온도',
    '히트펌프5_에러코드',
    '히트펌프5_운전모드',
    '히트펌프5_운전전류',
    '히트펌프5_인버터출력_1-1',
    '히트펌프5_인버터출력_1-2',
    '히트펌프5_인버터출력_2-1',
    '히트펌프5_인버터출력_2-2',
    '히트펌프5_입수온도',
    '히트펌프5_출수온도',
    '히트펌프6_기동정지',
    '히트펌프6_난방설정온도',
    '히트펌프6_냉방설정온도',
    '히트펌프6_에러코드',
    '히트펌프6_운전모드',
    '히트펌프6_운전전류',
    '히트펌프6_인버터출력_1-1',
    '히트펌프6_인버터출력_1-2',
    '히트펌프6_인버터출력_2-1',
    '히트펌프6_인버터출력_2-2',
    '히트펌프6_입수온도',
    '히트펌프6_출수온도',
    '히트펌프7_기동정지',
    '히트펌프7_난방설정온도',
    '히트펌프7_냉방설정온도',
    '히트펌프7_에러코드',
    '히트펌프7_운전모드',
    '히트펌프7_운전전류',
    '히트펌프7_인버터출력_1-1',
    '히트펌프7_인버터출력_1-2',
    '히트펌프7_인버터출력_2-1',
    '히트펌프7_인버터출력_2-2',
    '히트펌프7_입수온도',
    '히트펌프7_출수온도',
    '히트펌프8_기동정지',
    '히트펌프8_난방설정온도',
    '히트펌프8_냉방설정온도',
    '히트펌프8_에러코드',
    '히트펌프8_운전모드',
    '히트펌프8_운전전류',
    '히트펌프8_인버터출력_1-1',
    '히트펌프8_인버터출력_1-2',
    '히트펌프8_인버터출력_2-1',
    '히트펌프8_인버터출력_2-2',
    '히트펌프8_입수온도',
    '히트펌프8_출수온도',
    '히트펌프9_기동정지',
    '히트펌프9_난방설정온도',
    '히트펌프9_냉방설정온도',
    '히트펌프9_에러코드',
    '히트펌프9_운전모드',
    '히트펌프9_운전전류',
    '히트펌프9_인버터출력_1-1',
    '히트펌프9_인버터출력_1-2',
    '히트펌프9_인버터출력_2-1',
    '히트펌프9_인버터출력_2-2',
    '히트펌프9_입수온도',
    '히트펌프9_출수온도'
  ];


// function compareArrays(case1, case2) {
//     // 배열을 Set으로 변환하여 중복을 제거
//     const setCase1 = new Set(case1);
//     const setCase2 = new Set(case2);

//     // Case 1에만 있는 항목 추출
//     const case1Result = [...setCase1].filter(item => !setCase2.has(item));

//     // Case 2에만 있는 항목 추출
//     const case2Result = [...setCase2].filter(item => !setCase1.has(item));

//     // 결과 반환
//     return { case1Result, case2Result };
// }


// // 함수 호출
// const result = compareArrays(임대1, 임대2);

// // 결과 출력
// console.log('Case 1에만 있는 항목:', result.case1Result);
// console.log('Case 2에만 있는 항목:', result.case2Result);



// function stringToArray(inputString) {
//     // 개행 문자를 기준으로 문자열을 분할
//     const lines = inputString.split('\n');

//     // 빈 문자열 및 공백을 제거하고 배열에 담음
//     const resultArray = lines
//         .map(line => line.trim())
//         .filter(line => line !== '');

//     return resultArray;
// }


// 함수 호출
//console.log(stringToArray(test123));
//console.dir(stringToArray(임대1), {depth: null, colors: true, maxArrayLength: null});

let xml = '';
function generateXMLTags(array) {
    const result = array.map(item => 
       `<arg1>point:/스마트팜 임대형온실1/DDC-M/${item}</arg1>`
    );
    console.log(result);
    
    return result.join("")

  }

  
  const xmlTags = generateXMLTags(임대3);
console.dir(xmlTags, {depth: null, colors: true, maxArrayLength: null});
